{
  "candidate_name": "Zachary Leyden",
  "current_role": "Mid-Market & Enterprise Account Executive at N/A",
  "years_experience": 8.0,
  "overall_fit_score": 75,
  "fit_summary": "Zachary is a high-potential, non-traditional candidate with significant entrepreneurial experience (3x exited founder) and enterprise sales background, but lacks explicit evidence of selling to finance/accounting stakeholders or in AI/Fintech SaaS.",
  "score_breakdown": {
    "technical_skills": 50,
    "experience_relevance": 70,
    "leadership_potential": 90,
    "communication_signals": 85,
    "culture_fit_signals": 95,
    "growth_trajectory": 90
  },
  "skill_matches": [
    {
      "skill": "Closing Experience (AE)",
      "required_level": "1+ years",
      "candidate_level": "proficient",
      "evidence": "Current Role: Mid-Market & Enterprise Account Executive; 8 years experience; 'full-cycle Go-to-Market leadership'",
      "is_match": true
    },
    {
      "skill": "Startup/Scrappiness",
      "required_level": "Demonstrated drive/ambition; minimal structure",
      "candidate_level": "expert",
      "evidence": "3x exited founder; military veteran; specializing in 'driving enterprise growth in legacy industries'",
      "is_match": true
    },
    {
      "skill": "Enterprise/Mid-Market Sales",
      "required_level": "Mid-market and enterprise clients",
      "candidate_level": "expert",
      "evidence": "Mid-Market & Enterprise Account Executive; securing high-ACV deals ($50k-$500k+)",
      "is_match": true
    },
    {
      "skill": "SaaS/Fintech/Recruiting Tech",
      "required_level": "AE experience in SaaS, fintech, or recruiting tech",
      "candidate_level": "not_found",
      "evidence": "Industries listed: Enterprise Software, AgTech, Equestrian, Non-Profit, Government, Military. No explicit SaaS/Fintech mention.",
      "is_match": false
    },
    {
      "skill": "GTM Strategy/Process Refinement",
      "required_level": "Collaborate to refine sales processes and GTM strategy",
      "candidate_level": "expert",
      "evidence": "3x exited founder; Skills: GTM Strategy, Process Optimization, Revenue Operations",
      "is_match": true
    }
  ],
  "experience_highlights": [
    {
      "company": "N/A (Founder roles implied)",
      "role": "Founder/AE",
      "duration": "Implied 8 years",
      "key_achievement": "3x exited founder",
      "relevance": "Directly signals high drive, ambition, and ability to build/scale from zero, crucial for a Founding AE role."
    },
    {
      "company": "N/A (Implied)",
      "role": "AE/Sales Leader",
      "duration": "Implied 8 years",
      "key_achievement": "Securing high-ACV deals ($50k-$500k+)",
      "relevance": "Demonstrates ability to handle complex, high-value sales cycles, fitting the enterprise client focus."
    },
    {
      "company": "N/A (Implied)",
      "role": "GTM Leader",
      "duration": "Implied 8 years",
      "key_achievement": "Translating relationship-driven markets into scalable, repeatable revenue streams",
      "relevance": "Highly relevant to shaping the early GTM strategy and building repeatable processes for the AI marketplace."
    }
  ],
  "strengths": [
    {
      "strength": "Founding AE Mindset (Hustle)",
      "evidence": "3x exited founder and military veteran. This signals extreme resilience, ownership, and comfort with ambiguity.",
      "how_to_verify": "Ask about the biggest failure in one of his exits and how he recovered."
    },
    {
      "strength": "High-ACV Enterprise Sales",
      "evidence": "Securing high-ACV deals ($50k-$500k+). This suggests experience navigating complex procurement and multiple stakeholders.",
      "how_to_verify": "Ask him to walk through the stakeholder map for a recent $200k deal."
    },
    {
      "strength": "Strategic GTM Builder",
      "evidence": "Skills include GTM Strategy, ERP Implementation, Process Optimization, and Revenue Operations.",
      "how_to_verify": "Ask how he would structure the first 90 days of the sales process for a new AI product."
    },
    {
      "strength": "Digital Transformation Experience",
      "evidence": "Skills list Digital Transformation and ERP Implementation, suggesting comfort selling complex software solutions.",
      "how_to_verify": "Ask how he convinced a 'legacy industry' client to adopt a new ERP system."
    }
  ],
  "concerns": [
    {
      "concern": "Lack of Finance/Accounting ICP Evidence",
      "evidence": "The resume does not mention selling to CFOs, Controllers, or finance leaders, which is a key requirement.",
      "suggested_question": "Describe your experience selling to finance and accounting leaders. What are their unique motivations compared to operations or IT?",
      "severity": "high"
    },
    {
      "concern": "Industry Relevance Gap (AI/Fintech)",
      "evidence": "Experience is primarily in AgTech and Equestrian, not the required SaaS, Fintech, or Recruiting Tech.",
      "suggested_question": "How do you plan to rapidly bridge the knowledge gap required to sell an AI SaaS marketplace solution to finance teams?",
      "severity": "medium"
    },
    {
      "concern": "AE Closing Experience Specifics",
      "evidence": "The current role is listed as 'Mid-Market & Enterprise Account Executive at N/A' with no company or tenure details, making it hard to verify recent closing performance.",
      "suggested_question": "Can you share your quota attainment and average deal size over the last 4 quarters in your most recent AE role?",
      "severity": "medium"
    }
  ],
  "suggested_questions": [
    {
      "question": "The job requires selling to CFOs and Controllers. Walk me through a recent deal where you successfully navigated the finance approval process and addressed their specific concerns (e.g., ROI, budget allocation).",
      "category": "fit_check",
      "purpose": "Directly verify the most critical requirement (selling to finance stakeholders).",
      "follow_up": "What is the single biggest difference between selling to a CFO versus a Head of Operations?"
    },
    {
      "question": "As a 3x founder, you're used to being the CEO. How do you transition that mindset to collaborate effectively with our founders and execute their vision, even when you might disagree with the GTM strategy?",
      "category": "culture/collaboration",
      "purpose": "Assess coachability and ability to be a team player in a non-CEO role.",
      "follow_up": "Describe a time you had to execute a sales process you didn't design."
    },
    {
      "question": "You have experience in AgTech and Equestrian. How will you apply your experience translating 'relationship-driven markets' into scalable revenue streams for a fast-moving, AI-powered SaaS marketplace?",
      "category": "relevance/transferability",
      "purpose": "Determine how he plans to leverage his unique background to meet the job's demands.",
      "follow_up": "What is the biggest risk in applying your past sales methodologies to an AI product?"
    },
    {
      "question": "We need a Founding AE who thrives with minimal structure. Give me an example of a time you had to build a sales process (prospecting, qualification, CRM hygiene) from scratch, and what metrics you used to measure success.",
      "category": "process/scrappiness",
      "purpose": "Verify ability to build infrastructure and processes, not just execute existing ones.",
      "follow_up": "If you had no SDR support for 6 months, how would you prioritize your outbound efforts?"
    },
    {
      "question": "Your high-ACV deals are impressive. Tell me about a deal you lost that was over $100k. What was the core reason, and what did you implement afterward to prevent that loss vector?",
      "category": "behavioral/learning",
      "purpose": "Assess self-awareness, learning agility, and ability to handle failure.",
      "follow_up": "How did you communicate that loss to your leadership team?"
    }
  ],
  "topics_to_avoid": [
    "Do not dwell on the military experience unless he brings it up as a relevant skill (e.g., discipline, process). Focus on the founder/sales experience."
  ],
  "tldr": "Exceptional entrepreneurial drive and enterprise sales experience ($500k+ ACV). Ideal culture fit for a 'Founding AE' role. Major risk is zero explicit evidence of selling to finance/accounting leaders (CFOs/Controllers). Must verify this ICP fit immediately.",
  "key_things_to_remember": [
    "He is a 3x exited founder – this is a massive signal of ambition and ownership.",
    "He has experience with complex, high-ACV deals, which is required.",
    "The biggest gap is the ICP (finance leaders) and industry (AI/Fintech SaaS).",
    "His skills list includes GTM Strategy and Revenue Operations, suggesting he can contribute beyond just closing deals."
  ]
}