{
  "candidate_name": "David-Michael Ajudua",
  "current_role": "Co-Founder",
  "years_experience": 4.0,
  "overall_fit_score": 85,
  "fit_summary": "This candidate is an exceptional fit, possessing direct founder experience in AI-driven fintech and a proven background selling/building solutions for finance/accounting stakeholders.",
  "score_breakdown": {
    "technical_skills": 90,
    "experience_relevance": 95,
    "leadership_potential": 80,
    "communication_signals": 85,
    "culture_fit_signals": 95,
    "growth_trajectory": 90
  },
  "skill_matches": [
    {
      "skill": "Selling to Finance/Accounting (CFOs, Controllers)",
      "required_level": "Proficient",
      "candidate_level": "proficient",
      "evidence": "Co-founded Aiazing, an 'AI-driven invoicing and accounting tool' serving 'several thousand users.' This implies direct engagement with the ICP.",
      "is_match": true
    },
    {
      "skill": "SaaS/Fintech Closing Experience",
      "required_level": "Competent",
      "candidate_level": "proficient",
      "evidence": "Co-founded Aiazing (AI-driven invoicing/accounting tool) and worked at BlackRock (Investment Management Software) and Imply (Data Analytics Software).",
      "is_match": true
    },
    {
      "skill": "Startup/Scrappiness/Hustle",
      "required_level": "Proficient",
      "candidate_level": "expert",
      "evidence": "Co-founded Aiazing, an early-stage company, which is the ultimate signal of scrappiness and ability to thrive with minimal structure.",
      "is_match": true
    },
    {
      "skill": "AI/Technology Focus",
      "required_level": "Competent",
      "candidate_level": "proficient",
      "evidence": "Co-founded 'AI-driven invoicing and accounting tool, Aiazing.'",
      "is_match": true
    },
    {
      "skill": "Full Sales Cycle Ownership (AE)",
      "required_level": "Proficient",
      "candidate_level": "competent",
      "evidence": "The resume implies full GTM ownership as a Co-Founder, but lacks explicit 'AE closing' titles/metrics. Needs verification.",
      "is_match": true
    }
  ],
  "experience_highlights": [
    {
      "company": "Aiazing (Co-Founder)",
      "role": "Co-Founder",
      "duration": "Implied 1+ years (current focus)",
      "key_achievement": "Built and scaled an AI-driven invoicing and accounting tool to 'several thousand users.'",
      "relevance": "Directly relevant to the job's ICP (accounting/finance), technology (AI/SaaS), and stage (Founding role)."
    },
    {
      "company": "BlackRock",
      "role": "N/A (Implied technical/financial role)",
      "duration": "N/A",
      "key_achievement": "Experience with 'Investment Management Software.'",
      "relevance": "Provides enterprise-level financial technology context, which is valuable for selling to mid-market/enterprise finance leaders."
    },
    {
      "company": "Citi (Internships)",
      "role": "Investment Banking Intern",
      "duration": "N/A",
      "key_achievement": "Background in Investment Banking.",
      "relevance": "Strong financial acumen and understanding of corporate finance pain points, enhancing consultative selling ability."
    }
  ],
  "strengths": [
    {
      "strength": "Deep ICP and Domain Expertise",
      "evidence": "Co-founded an accounting/invoicing tool and worked in Investment Management/Banking. They speak the finance leader's language.",
      "how_to_verify": "Ask them to diagnose a common pain point for a Controller using their product (Aiazing) as context."
    },
    {
      "strength": "Founding/GTM Mindset (Culture Fit)",
      "evidence": "As a Co-Founder, they have demonstrated the ability to 'shape the go-to-market strategy' and 'thrive with minimal structure,' which is critical for a Founding AE.",
      "how_to_verify": "Ask about their biggest GTM mistake at Aiazing and what they learned."
    },
    {
      "strength": "AI/SaaS Product Fluency",
      "evidence": "The product they built is 'AI-driven.' They can credibly sell complex AI solutions.",
      "how_to_verify": "Ask them to explain the difference between a feature-based sale and a platform sale in the context of AI."
    },
    {
      "strength": "Proven Ambition and Drive",
      "evidence": "Transitioned from BlackRock/Citi background to co-founding a startup, signaling high risk tolerance and 'hunger to succeed.'",
      "how_to_verify": "Ask: 'Why leave the stability of a big firm to start Aiazing, and why are you now looking to join another startup?'"
    }
  ],
  "concerns": [
    {
      "concern": "Lack of Explicit AE Closing Metrics/Title",
      "evidence": "The resume lists 'Co-Founder' and 'Business Development' skills, but not 'Account Executive' or specific quota attainment/closing metrics.",
      "suggested_question": "As a Co-Founder at Aiazing, what was your personal revenue target, and what was your closing ratio on qualified leads?",
      "severity": "high"
    },
    {
      "concern": "Sales Cycle Ownership vs. Product/Biz Dev",
      "evidence": "It's unclear if their role at Aiazing was primarily product development, technical sales, or pure closing/quota-carrying AE.",
      "suggested_question": "Walk me through the last $50k deal you personally closed at Aiazing. Who sourced it, what was the timeline, and what was the biggest objection?",
      "severity": "high"
    },
    {
      "concern": "Experience Selling a Marketplace Model",
      "evidence": "Their experience is in selling a single SaaS tool (invoicing/accounting), not a two-sided marketplace model.",
      "suggested_question": "How does selling a single SaaS product differ from selling a marketplace solution, and what challenges do you anticipate?",
      "severity": "medium"
    }
  ],
  "suggested_questions": [
    {
      "question": "As a Founding AE, you must build the playbook. Based on your experience at Aiazing, what are the first three steps you would take to establish our outbound sales motion?",
      "category": "strategy",
      "purpose": "Assess strategic thinking and ability to build structure from scratch.",
      "follow_up": "How would you measure the success of those steps in the first 90 days?"
    },
    {
      "question": "Tell me about the most complex deal you personally closed at Aiazing. Specifically, who was the economic buyer, and what was the biggest competitive threat?",
      "category": "closing_skills",
      "purpose": "Verify closing experience and ability to navigate enterprise sales cycles.",
      "follow_up": "What was the average contract value (ACV) of your closed deals?"
    },
    {
      "question": "Our ICP is finance leaders. If a CFO told you, 'We already use [Competitor X] for our accounting needs,' how would you pivot the conversation to focus on the value of our AI marketplace?",
      "category": "consultative_selling",
      "purpose": "Test domain knowledge and ability to handle complex objections.",
      "follow_up": "How do you handle procurement and legal review in a mid-market deal?"
    },
    {
      "question": "You have experience in both large finance firms (BlackRock/Citi) and a startup (Aiazing). How will you leverage your 'big company' understanding to sell to enterprise clients, while maintaining the 'startup hustle' required here?",
      "category": "culture_fit",
      "purpose": "Assess self-awareness and ability to bridge corporate and startup environments.",
      "follow_up": "What is the biggest difference between selling to a startup vs. a Fortune 500 finance team?"
    },
    {
      "question": "The job requires collaborating closely with founders to refine the GTM. Describe a time you had to deliver difficult feedback to a co-founder or executive regarding product-market fit or sales process.",
      "category": "collaboration/influence",
      "purpose": "Evaluate communication skills and ability to influence strategy.",
      "follow_up": "What was the outcome, and how did you ensure the relationship remained strong?"
    }
  ],
  "topics_to_avoid": [
    "Do not dwell on the specifics of the Aiazing product's technical architecture unless they bring it up; focus strictly on the sales/GTM aspects."
  ],
  "tldr": "Exceptional domain expertise (Fintech, Accounting, AI) and clear founder-level drive. The primary risk is verifying that 'Co-Founder' translates directly into 1+ years of quota-carrying AE closing experience. Focus the interview on specific closing metrics, deal ownership, and GTM strategy building.",
  "key_things_to_remember": [
    "He has built the product (Aiazing) he would be selling against/alongside—a huge advantage.",
    "The 'Founding AE' title aligns perfectly with his Co-Founder background.",
    "He meets the 1+ year closing experience requirement only if his Co-Founder role included direct sales.",
    "Strong signals for selling to the required ICP (CFOs/Controllers)."
  ]
}